# CannotCreateNewDesignOption Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..CreationFailures..::..CannotCreateNewDesignOption Property
BuiltInFailures..::..CreationFailures Class See Also
---
Cannot create a new empty design option
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotCreateNewDesignOption { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotCreateNewDesignOption As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotCreateNewDesignOption {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..CreationFailures Class
Autodesk.Revit.DB Namespace